{
    "name": "Emmanuel Oranwusi",
    "serial": 1,
    "position": "President",
    "level": 500,
    "image": "/assets/images/excos/studio_pics/presido.jpg",
    "bio": "My name is Emmanuel Oranwusi, the President Of The Nile University Medical Students Association and I am a medical student of the prestigious university, Nile University of Nigeria. In 2016, I embarked on a transformative journey by securing admission to study Medicine and Surgery at Abia State University. Just like each of you, I became part of a community with a shared dream of becoming healers and contributors to Nigeria's healthcare landscape. In the realm of higher education, it wasn't merely about attending classes for me; it unfolded as a odyssey of observing, learning, and personal maturation. With firsthand encounters and the sagacious guidance of inspiring leaders, the profound potential to leave an enduring imprint on our association, and consequently, our nation's healthcare, became evident. Fast forward to July 2022, I found myself walking through the esteemed halls of Nile University as a transfer student who has faced challenges, including incessant strikes and fazed with unattained goals. Yet, with time, I've come to understand that every twist and turn was part of a larger plan. Today, I stand before you ready to share my vision for our collective future and contribute to shaping a brighter path for Nile University Medical Students' Association. Ray Kroc once remarked, 'The quality of a leader is reflected in the standards they set for themselves.' My vision for NUMSA in 2024 transcends conventional standards. It seeks to position our association as a beacon of growth, unity, and impactful service. Through strategic initiatives, educational programs, and collaborative efforts, we will amplify NUMSA's influence on the broader medical community and lay the groundwork for a legacy that resonates for generations. As we embark on this transformative journey, I draw inspiration from Max DePree's words, 'The first responsibility of a leader is to define reality. The last is to say thank you. In between, the leader is a servant.' I am here not to dictate but to serve, to define our shared reality, and to express my gratitude for the privilege of leading NUMSA into a future of boundless potential. NUMSA, let our shared vision be that waking dream. With '#CapacityBuilding' as our guiding light, we can transform challenges into opportunities and elevate our association to new heights. I am excited about the prospect of leading NUMSA in 2024, and together, let us embark on a journey of growth, empowerment, and capacity building."

  }
